Revit 2024 API
ElementTypeDuplicatedEventArgs.OriginalElementTypeId Property
 The id of the element type that is duplicated.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ElementId OriginalElementTypeId { get; }
Visual Basic
Public ReadOnly Property OriginalElementTypeId As ElementId
	Get
Visual C++
public:
property ElementId^ OriginalElementTypeId {
	ElementId^ get ();
}
See Also
ElementTypeDuplicatedEventArgs Class
Autodesk.Revit.DB.Events Namespace